[
     {
        "id": 1,
        "title": "Electroreception",
        "content": "Open your eyes in sea water and it is difficult to see much more than a murky, bleary green colour. Sounds, too, are garbled and difficult to comprehend. Without specialised equipment humans would be lost in these deep-sea habitats, so how do fish make it seem so easy? Much of this is due to a biological phenomenon known as electroreception – the ability to perceive and act upon electrical stimuli as part of the overall senses. This ability is only found in aquatic or amphibious species because water is an efficient conductor of electricity.<br /><br /> Electroreception comes in two variants. While all animals (including humans) generate electric signals, because they are emitted by the nervous system, some animals have the ability – known as passive electroreception – to receive and decode electric signals generated by other animals in order to sense their location. Other creatures can go further still, however. Animals with active electroreception possess bodily organs that generate special electric signals on cue. These can be used for mating signals and territorial displays as well as locating objects in the water. This can help them identify whether another creature is prey, predator or something that is best left alone.<br /><br /> Normally, when humans are attacked it is purely by accident. Since sharks cannot detect from electroreception whether or not something will satisfy their tastes, they tend to “try before they buy”, taking one or two bites and then assessing the results. Repeat attacks are highly likely once a human is bleeding, however; the force of the electric field is heightened by salt in the blood which creates the perfect setting for a feeding frenzy.  In areas where shark attacks on humans are likely to occur, scientists are exploring ways to create artificial electroreceptors that would disorient the sharks and repel them from swimming beaches.<br /><br /> There is much that we do not yet know concerning how electroreception functions. Although researchers have documented how electroreception alters hunting, defence and communication systems through observation, the exact neurological processes that encode and decode this information are unclear. Scientists are also exploring the role electroreception plays in navigation. Some have proposed that salt water and magnetic fields from the Earth’s core may interact to form electrical currents that sharks use for migratory purposes."

    },
    {
        "id": 2,
        "title": "Euthanasia",
        "content": "The word euthanasia is of Greek origin and literally means “a good death.” The American Heritage Dictionary defines it as “the act of killing a person painlessly for reasons of mercy.” Such killing can be done through active means, such as administering a lethal injection, or by passive means, such as withholding medical care or food and water.<br /><br />In recent years in the United States, there have been numerous cases of active euthanasia in the news. They usually involve the deliberate killing of ill or incapacitated persons by relatives or friends who plead that they can no longer bear to see their loved ones suffer. Every year, in hospitals and nursing homes around the country, there are growing numbers of documented deaths caused by caregivers withholding life sustaining care, including food and water, from vulnerable patients who cannot speak for themselves.<br /><br />While it is illegal to kill someone directly, for example with a gun or knife, in many cases the law has put its stamp of approval on causing death by omitting needed care. Further, many states have “living will” laws designed to protect those who withhold treatment, and there have been numerous court rulings which have approved of patients being denied care and even starved and dehydrated to death. Because such deaths occur quietly within the confines of hospitals and nursing homes, they can be kept hidden from the public. Most euthanasia victims are old or very ill, so their deaths might be attributed to a cause other than the denial of care that really killed them. Further, it is often relatives of the patient who request that care be withheld.<br /><br />No one has the right to judge that another’s life is not worth living. The basic right to life should not be abridged because someone decides that someone else’s quality of life is too low. If we base the right to life on quality-of-life standards, there is no logical place to draw the line. To protect vulnerable patients, we must foster more positive attitudes towards people with serious and incapacitating illnesses and conditions. Despite the ravages of their diseases, they are still our fellow human beings and deserve our care and respect. We must also enact positive legislation that will protect vulnerable people from those who consider their lives meaningless or too costly to maintain and who would cause their deaths by withholding life-sustaining care such as food and water."

    },
    {
        "id": 3,
        "title": "Ordinary foodstuff",
        "content": "In these trying times, when buying ordinary foodstuff can burn a hole in our pockets, comes the news that can actually help us save some hard cash when we go out to shop the next time. According to a Stanford University study, a first of its kind in the world, there is no evidence to suggest that there are more nutritional benefits from expensive organic food than those grown by conventional methods. The researchers add that there is no difference in protein and fat content between organic and conventional milk and the vitamin count is similar in both types.<br /><br /> The only benefit is that organic foods are not contaminated with pesticides, but then, before you chew on that plate of organic okra with roti made from organic wheat, they are not 100% pesticide-free either. In India, organic food has been growing at 20–22% and the export market is valued at `1,000 crores. Obviously, the study is not good news for that sector and for people who are big on organic food. In India, eating organic food is more of a style statement than due to health worries because the stuff is expensive. But people who can, do indulge in not only organic vegetables but even organic eggs laid by ‘happy hens’, who are allowed to roam around freely, whereas ‘unhappy hens’ are kept in coops.<br /><br /> Then some companies have installed music channels in their cowsheds and the milk from those sheds is sold at a marked-up price since it has more nutritional value because the animals are happy thanks to lilting 24 × 7 music. We don‘t know yet of any farmer using music to improve his crop quality, but then you never know: plants are known to respond to music.<br /><br /> Why such pickiness about food? These days, the huge number of TV shows and articles that we see and read on food provide bread and butter for the specialists. But instead of decoding food, its sources, and what has gone into growing it, isn‘t it much better to enjoy what‘s on the plate?"

    },
    {
        "id": 4,
        "title": "Teaching HOT Skills",
        "content": "Despite the importance of knowledge in education, nowadays it’s highly recommended to move students further than memorizing information and focus on developing their cognitive skills. These skills are divided into two levels: the lower-order thinking skills (LOTS) and the higher-order thinking skills (HOTS) based on Bloom’s Taxonomy (1965). In this regard, the educational experts are calling to promote HOT skills in order to help students be more critical and creative, for instance, in questioning and problem-solving.<br /><br /><br /><br />What is higher-order thinking?<br /><br />Higher-order thinking, or “HOT” in brief, takes thinking beyond recalling facts to higher levels. Instead of memorizing facts, HOT skills enable students to understand them, associate them with other facts, go beyond them, infer from them, use them in new contexts, categorize them, and apply them while solving new problems. Higher-order thinking skills are derived from the top three levels in Bloom’s Taxonomy: analysis, synthesis, and evaluation.<br /><br />There are numerous activities teachers can implement to enhance HOT skills. These activities should enable students to invest the acquired information to develop more skills. They may be asked to create a new ending to a book or a story or to discuss why a particular character in a novel behaved in a certain way. In language learning classes, teachers can ask learners to induce new grammar rules or new vocabulary. All These kinds of activities demand higher-order thinking skills."

    },
    {
        "id": 5,
        "title": "Testing on Animals",
        "content": "Tens of millions of animals are killed every year in scientific research and testing. Their number has grown over recent years, most probably because more biomedical research is being carried out around the world. The most commonly used animals are mice, fish, and rats, but many other species including monkeys, cats, dogs, horses and pigs are also used. Animals are experimented on for many reasons. These include understanding human biology, developing and testing cure for humans and obtaining fundamental knowledge in teaching. Furthermore, many companies depend on animals for testing the safety of their substances and products. Another major reason is developing veterinary treatments for other animals.<br /><br />Scientists insist that new remedies for serious illnesses cannot be developed unless their safety and efficacy are tested on animals. Similarly, they argue that understanding basic biology and creating new medicines cannot be achieved without animal research. “Consequences will be terrible if research using animals is blocked,” said Nancy Lee, senior policy adviser in London.<br /><br />However, we may no longer need to rely on animals to test the safety of different medications, chemicals, or cosmetics in the future. A few months ago, scientists developed the first computer system known as RASCAR which can accurately detect toxic substances. RASCAR is just one of many potential alternatives to animal testing. “I’m extremely optimistic about this and other similar tools to restrict animal testing,” says Andrew Rowan, chief scientific officer for The Humane Society of the United States. “Using animals in tests is significantly very expensive. It takes three years to do comprehensive testing while RASCAR takes only few minutes,” he adds.<br /><br />Tom Regan, a philosophy professor in the USA, states: “Animals and people are alike in many ways; they both feel, think, behave, and experience pain.” Thus, animals should be treated with the same respect as humans. When animals are reduced to being mere tools in a scientific experiment, their rights are taken away without any thought of their well-being. Tests often cause pain and suffering or even death."

    }
]